music_app/app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 2]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    if params[:artist_id]
      @albums = Artist.find(params[:artist_id]).albums
    else
      @albums = Album.all